Revit API Introduction Labs
Lab2_5_SelectAndMoveWallAndAddColumns Class
 Demonstrate creation of new family instance elements by querying an existing wall for its location and parameters, modifying it, and inserting column elements.
This makes use of the following new functionality:
Pre-selection and interactive prompted selection process.
Read access to wall parameters, and modification of wall location.
Making use of LINQ in a filtered element query.
 To run this command, select a wall. It must be constrained to a level at the top, e.g. using Element Properties... > Constraints > Top Constraint, otherwise an error message is displayed. Load the column family named "M_Wood Timber Column" and the type named "191 x 292mm" prior to running the command, or else use the error message displayed to explain about the missing family, or modify the names to refer to some family type that is loaded. The selected wall is used to define three columns at its end and mid points, then the wall is moved out of the way to clearly display the columns.
 Namespace: Labs
 Assembly: labs (in labs.dll) Version: 3.0.0.1 (3.0.0.1)
Syntax
C#
public class Lab2_5_SelectAndMoveWallAndAddColumns : IExternalCommand
Visual Basic (Declaration)
Public Class Lab2_5_SelectAndMoveWallAndAddColumns _
	Implements IExternalCommand
Visual C++
public ref class Lab2_5_SelectAndMoveWallAndAddColumns : IExternalCommand
Remarks
 Note: the column can be seen in 3D view by setting argument to StructuralType.Column, but cannot by StructuralType.NonStructural, since the latter is only visible in plan view. This is a temporary problem, NewFamilyInstance identifies the nonstructural instance as an annotation instance, so only shows them in plan view.
Inheritance Hierarchy
System.Object
 Labs.Lab2_5_SelectAndMoveWallAndAddColumns
See Also
Lab2_5_SelectAndMoveWallAndAddColumns Members
Labs Namespace